{"description":"Build a 2D boss-fight action game using JavaScript and the Phaser.js framework, playable directly in a web browser.\n\nGameplay Overview:\n- The game features one player character and one boss enemy.\n- The entire fight takes place inside a single arena, similar to Hollow Knight boss rooms.\n- The camera stays centered on the arena.\n\nPlayer Controls:\n- Move left/right: A / D or ← / → keys\n- Jump: W or Spacebar\n- Dodge: Shift key\n  - Dodge direction depends on the movement key being held.\n  - If no movement key is held, dash backward.\n- Attack: J key (melee slash)\n  - When attacking, show a white arc effect similar to Hollow Knight’s nail slash.\n  - Include hit flash or brief particle effects when striking enemies.\n\nBoss Behavior:\n- The boss has three attack types:\n  1. Melee swing (close-range attack)\n  2. Jump attack (leaps toward player)\n  3. Projectile attack (fires energy balls toward the player)\n- Include simple telegraph animations or flashing before major attacks.\n- The boss moves intelligently within the arena boundaries and reacts to player proximity.\n\nHealth System:\n- Player Health:\n  - Displayed in the top-left corner using Hollow Knight–style masks.\n  - Each mask represents one hit point. Losing HP breaks a mask.\n  - Start with 5–6 masks.\n- Boss Health:\n  - Displayed at the bottom center, Dark Souls–style.\n  - A long red bar with the boss name above it (e.g., \"Ancient Guardian\").\n\nVisual & UX:\n- Use smooth sprite animations for player and boss actions.\n- Attack effects should have short white slash arcs or brief impact flashes.\n- Use img/player.jpg and img/boss.jpg for base character sprites.\n- The arena should have a dark, atmospheric background (gray or navy gradient).\n- Show visual feedback (screen shake or brief flash) on successful hits.\n\nTechnical Implementation:\n- Use Phaser.js 3 or newer for rendering, physics, animation, and input.\n- Organize the project into scenes:\n  - PreloadScene (loads assets)\n  - GameScene (main boss fight)\n  - UIScene (health bars and boss name)\n- Use Phaser’s Arcade Physics for collision and movement.\n- Maintain a stable 60 FPS performance.\n- Modularize logic into Player, Boss, AttackManager, and GameManager classes.\n\nGoal:\nDeliver a playable prototype where the player can move, jump, dodge, and attack using responsive controls to defeat a single animated boss with multiple attack patterns."}